src/DataProcessors/РасчётСреднихЦен/РасчётСреднихЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РасчётСреднихЦен</name>
</mdclass:DataProcessor>

src/InformationRegisters/ЦеныСредние/ЦеныСредние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныСредние</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ПоступлениеМПЗ/ПоступлениеМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеМПЗ</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.Реализация</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Реализация</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокВходящий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокВходящий</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <comment>Текущий курс</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>НЦ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаВалюта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВалюта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоВалюта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГТД</name>
      <comment>Номер грузовой таможенной декларации</comment>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВводОстатковМПЗ/ВводОстатковМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОстатковМПЗ</name>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/РасчётСреднихЦен/Forms/Форма/Module.bsl
&НаСервере
Процедура РассчитатьНаСервере()
Запрос = Новый Запрос; 
ТаблицаМПЗ = Новый ТаблицаЗначений;

ТаблицаМПЗ.Колонки.Добавить("МПЗ");
ТаблицаМПЗ.Индексы.Добавить("МПЗ");
ТаблицаМПЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(14,3)));
ТаблицаМПЗ.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(14,2))); 

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныСредниеСрезПоследних.МПЗ КАК МПЗ,
	|	ЦеныСредниеСрезПоследних.Количество КАК Количество,
	|	ЦеныСредниеСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныСредние.СрезПоследних(&НаДату, ) КАК ЦеныСредниеСрезПоследних";
	Если СписокМПЗ.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " ГДЕ ЦеныСредниеСрезПоследних.МПЗ В ИЕРАРХИИ(&СписокМПЗ)";
	Запрос.УстановитьПараметр("СписокМПЗ", СписокМПЗ);
	КонецЕсли;
Запрос.УстановитьПараметр("НаДату", НачалоМесяца(Период.ДатаНачала-1));
РезультатЗапроса = Запрос.Выполнить();
ТаблицаСреднихЦен = РезультатЗапроса.Выгрузить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	РЦС = РегистрыСведений.ЦеныСредние.СоздатьМенеджерЗаписи();
	РЦС.Период = Период.ДатаНачала;
	РЦС.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;
	РЦС.Количество = ОбщийМодульРаботаСРегистрами.ПолучитьСводныйОстаток(ВыборкаДетальныеЗаписи.МПЗ,Период.ДатаОкончания+1);
	РЦС.Цена = ВыборкаДетальныеЗаписи.Цена;
	РЦС.Записать(Истина);
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеМПЗТабличнаяЧасть.МПЗ КАК МПЗ,
	|	ПоступлениеМПЗТабличнаяЧасть.Количество КАК Количество,
	|	ПоступлениеМПЗТабличнаяЧасть.Цена КАК Цена,
	|	ПоступлениеМПЗТабличнаяЧасть.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	Документ.ПоступлениеМПЗ.ТабличнаяЧасть КАК ПоступлениеМПЗТабличнаяЧасть
	|ГДЕ
	|	ПоступлениеМПЗТабличнаяЧасть.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ПоступлениеМПЗТабличнаяЧасть.Ссылка.Проведен = ИСТИНА
	|	И ПоступлениеМПЗТабличнаяЧасть.МПЗ ССЫЛКА Справочник.Материалы";
	Если СписокМПЗ.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ПоступлениеМПЗТабличнаяЧасть.МПЗ В ИЕРАРХИИ(&СписокМПЗ)";
	Запрос.УстановитьПараметр("СписокМПЗ", СписокМПЗ);
	КонецЕсли;
Запрос.Текст = Запрос.Текст + " ИТОГИ ПО МПЗ";
Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаМПЗ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМПЗ.Следующий() Цикл 
	ТЧ = ТаблицаМПЗ.Добавить();
	ТЧ.МПЗ = ВыборкаМПЗ.МПЗ;              
	Выборка = ТаблицаСреднихЦен.Найти(ВыборкаМПЗ.МПЗ,"МПЗ");
		Если Выборка <> Неопределено Тогда
		ТЧ.Количество = Выборка.Количество;
		ТЧ.Сумма = Выборка.Цена*Выборка.Количество;		
		Иначе	
		ТЧ.Количество = 0;
		ТЧ.Сумма = 0;		
		КонецЕсли;
	ВыборкаДетальныхЗаписей = ВыборкаМПЗ.Выбрать();
		Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
		БазовоеКоличество = ПолучитьБазовоеКоличествоБезОкругления(ВыборкаДетальныхЗаписей.Количество,ВыборкаДетальныхЗаписей.ЕдиницаИзмерения);
		Коэфф = ВыборкаДетальныхЗаписей.ЕдиницаИзмерения.Коэффициент; 
		БазоваяЦена = ?(Коэфф > 0,Окр(ВыборкаДетальныхЗаписей.Цена/ВыборкаДетальныхЗаписей.ЕдиницаИзмерения.Коэффициент,2,1),ВыборкаДетальныхЗаписей.Цена);
        ТЧ.Количество = ТЧ.Количество+БазовоеКоличество;
		ТЧ.Сумма = ТЧ.Сумма+(БазоваяЦена*БазовоеКоличество); 
		КонецЦикла;	
	КонецЦикла;	   
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВводОстатковМПЗТабличнаяЧасть.МПЗ КАК МПЗ,
	|	ВводОстатковМПЗТабличнаяЧасть.Количество КАК Количество,
	|	ВводОстатковМПЗТабличнаяЧасть.Цена КАК Цена
	|ИЗ
	|	Документ.ВводОстатковМПЗ.ТабличнаяЧасть КАК ВводОстатковМПЗТабличнаяЧасть
	|ГДЕ
	|	ВводОстатковМПЗТабличнаяЧасть.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ВводОстатковМПЗТабличнаяЧасть.Ссылка.Проведен = ИСТИНА
	|	И ВводОстатковМПЗТабличнаяЧасть.МПЗ ССЫЛКА Справочник.Материалы";
	Если СписокМПЗ.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ВводОстатковМПЗТабличнаяЧасть.МПЗ В ИЕРАРХИИ(&СписокМПЗ)";
	Запрос.УстановитьПараметр("СписокМПЗ", СписокМПЗ);
	КонецЕсли;
Запрос.Текст = Запрос.Текст + " ИТОГИ ПО МПЗ";
Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаМПЗ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМПЗ.Следующий() Цикл
	Выборка = ТаблицаМПЗ.Найти(ВыборкаМПЗ.МПЗ,"МПЗ");
		Если Выборка = Неопределено Тогда
		ТЧ = ТаблицаМПЗ.Добавить();
		ТЧ.МПЗ = ВыборкаМПЗ.МПЗ; 		
		Выборка = ТаблицаСреднихЦен.Найти(ВыборкаМПЗ.МПЗ,"МПЗ");
			Если Выборка <> Неопределено Тогда
			ТЧ.Количество = Выборка.Количество;
			ТЧ.Сумма = Выборка.Цена*Выборка.Количество;		
			Иначе	
			ТЧ.Количество = 0;
			ТЧ.Сумма = 0;		
			КонецЕсли;
		Иначе
	   	ТЧ = Выборка;
		КонецЕсли;            
	ВыборкаДетальныхЗаписей = ВыборкаМПЗ.Выбрать();
		Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
        ТЧ.Количество = ТЧ.Количество+ВыборкаДетальныхЗаписей.Количество;
		ТЧ.Сумма = ТЧ.Сумма+(ВыборкаДетальныхЗаписей.Цена*ВыборкаДетальныхЗаписей.Количество); 
		КонецЦикла;	
	КонецЦикла;
		Для каждого ТЧ Из ТаблицаМПЗ Цикл
		ЦенаСредняя = ?(ТЧ.Количество > 0,ТЧ.Сумма/ТЧ.Количество,0);
		РЦС = РегистрыСведений.ЦеныСредние.СоздатьМенеджерЗаписи();
		РЦС.Период = Период.ДатаНачала;
		РЦС.МПЗ = ТЧ.МПЗ;
		РЦС.Количество = ОбщийМодульРаботаСРегистрами.ПолучитьСводныйОстаток(ТЧ.МПЗ,Период.ДатаОкончания+1);
		РЦС.Цена = ЦенаСредняя;
		РЦС.Записать(Истина);		
		КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	РассчитатьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РассчитатьНачальныеОстаткиНаСервере()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаХраненияОстатки.МПЗ КАК МПЗ,
	|	МестаХраненияОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.МестаХранения.Остатки(&НаДату, МПЗ ССЫЛКА Справочник.Материалы) КАК МестаХраненияОстатки
	|ГДЕ
	|	МестаХраненияОстатки.КоличествоОстаток > 0";
	Если СписокМПЗ.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И МестаХраненияОстатки.МПЗ В ИЕРАРХИИ(&СписокМПЗ)";
	Запрос.УстановитьПараметр("СписокМПЗ", СписокМПЗ);
	КонецЕсли;
Запрос.Текст = Запрос.Текст + " ИТОГИ
								|	СУММА(КоличествоОстаток)
								|ПО
								|	МПЗ";
Запрос.УстановитьПараметр("НаДату", Период.ДатаОкончания);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаМПЗ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМПЗ.Следующий() Цикл
	РЦС = РегистрыСведений.ЦеныСредние.СоздатьМенеджерЗаписи();
	РЦС.Период = Период.ДатаНачала;
	РЦС.МПЗ = ВыборкаМПЗ.МПЗ;
	РЦС.Количество = ВыборкаМПЗ.КоличествоОстаток;
	РЦС.Цена = ОбщийМодульВызовСервера.ПолучитьПоследнююЦену(ВыборкаМПЗ.МПЗ,Период.ДатаОкончания);
	РЦС.Записать(Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьНачальныеОстатки(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	РассчитатьНачальныеОстаткиНаСервере();
	КонецЕсли;
КонецПроцедуры
